spiricom/Electrosteel_stringsensor/cube_for_new_genera_brain4.ioc
Dma.SPI2_RX.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
FMC.ColumnBitsNumber1=FMC_SDRAM_COLUMN_BITS_NUM_9
PE6.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
SH.FMC_D3_DA3.0=FMC_D3,sd-16b-d1
ProjectManager.CustomerFirmwarePackage=
Dma.ADC1.0.EventEnable=DISABLE
ADC3.OffsetSignedSaturation-2\#ChannelRegularConversion=DISABLE
PCC.Seq0.Step0.Category=In DS Table
SH.FMC_A7.ConfNb=1
Bdma.ADC3.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
SH.FMC_A1.ConfNb=1
Dma.ADC1.0.Instance=DMA1_Stream0
Dma.SPI2_RX.1.PeriphBurst=DMA_PBURST_SINGLE
PD2.GPIO_PuPd=GPIO_PULLUP
VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC.Mode=SAI_A_BASIC
Dma.ADC1.0.SyncRequestNumber=1
ADC1.IPParameters=ClockPrescaler,ConversionDataManagement,EOCSelection,EnableInjectedConversion,EnableRegularConversion,Rank-16\#ChannelRegularConversion,Channel-16\#ChannelRegularConversion,SamplingTime-16\#ChannelRegularConversion,OffsetNumber-16\#ChannelRegularConversion,NbrOfConversionFlag,Rank-17\#ChannelRegularConversion,Channel-17\#ChannelRegularConversion,SamplingTime-17\#ChannelRegularConversion,OffsetNumber-17\#ChannelRegularConversion,Rank-18\#ChannelRegularConversion,Channel-18\#ChannelRegularConversion,SamplingTime-18\#ChannelRegularConversion,OffsetNumber-18\#ChannelRegularConversion,Rank-19\#ChannelRegularConversion,Channel-19\#ChannelRegularConversion,SamplingTime-19\#ChannelRegularConversion,OffsetNumber-19\#ChannelRegularConversion,NbrOfConversion,Offset-16\#ChannelRegularConversion,Offset-17\#ChannelRegularConversion,Offset-18\#ChannelRegularConversion,Offset-19\#ChannelRegularConversion,OversamplingMode,NbrOfDiscConversion,Overrun,ExternalTrigConvEdge,master,ContinuousConvMode,RightBitShift
Dma.SPI2_TX.4.Priority=DMA_PRIORITY_LOW
RCC.SWPMI1Freq_Value=120000000
Bdma.ADC3.0.RequestNumber=1
PD1.Signal=FMC_D3_DA3
VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC.Signal=SAI1_VP_$IpInstance_SAIA_SAI_BASIC
RCC.DIVP2=7
PCC.Line=STM32H743/753
ADC1.ExternalTrigConvEdge=ADC_EXTERNALTRIGCONVEDGE_NONE
PC0.Signal=FMC_SDNWE
PC11.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Mode
RCC.QSPIFreq_Value=240000000
Dma.SAI1_B.3.Priority=DMA_PRIORITY_HIGH
Bdma.ADC3.0.SyncEnable=DISABLE
PG10.Signal=GPIO_Output
PG10.Locked=true
SH.FMC_A3.0=FMC_A3,13b-sda1
RCC.USART234578Freq_Value=120000000
PA11.Locked=true
FMC.CASLatency1=FMC_SDRAM_CAS_LATENCY_2
RCC.SPI123Freq_Value=49142857.14285714
PB11.Mode=I2C
PB14.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Bdma.ADC3.0.Direction=DMA_PERIPH_TO_MEMORY
SH.FMC_D15_DA15.0=FMC_D15,sd-16b-d1
Dma.ADC1.0.SignalID=NONE
PA9.Signal=GPIO_Output
Dma.SAI1_B.3.Polarity=HAL_DMAMUX_REQ_GEN_RISING
RCC.DIVN2=344
RCC.DIVN1=192
Dma.SAI1_B.3.PeriphInc=DMA_PINC_DISABLE
PC2_C.Mode=SdramChipSelect1_1
ADC3.NbrOfConversion=2
Dma.SAI1_B.3.MemBurst=DMA_MBURST_SINGLE
Dma.SPI2_TX.4.MemBurst=DMA_MBURST_SINGLE
PB10.Signal=I2C2_SCL
FATFS.BSP.number=1
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
ProjectManager.LastFirmware=true
Dma.SPI2_RX.1.SyncEnable=DISABLE
Dma.SPI2_TX.4.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PA1.Mode=IN17-Single-Ended
PE15.Signal=FMC_D12_DA12
PE8.Signal=FMC_D5_DA5
Dma.SAI1_A.2.SyncEnable=DISABLE
Dma.SPI2_TX.4.MemDataAlignment=DMA_MDATAALIGN_BYTE
PCC.Seq0.Step0.SubMode3=DRUN
Bdma.ADC3.0.MemDataAlignment=DMA_MDATAALIGN_WORD
PCC.Seq0.Step0.SubMode2=DRUN
FATFS0.BSP.i2creg=
RCC.RNGFreq_Value=48000000
PC11.GPIO_Mode=GPIO_MODE_AF_PP
PCC.Seq0.Step0.SubMode1=DRUN/CRUN
PA9.Locked=true
SH.FMC_SDNCAS.0=FMC_SDNCAS,13b-sda1
ProjectManager.FreePins=true
RCC.LPTIM2Freq_Value=120000000
SH.FMC_NBL1.ConfNb=1
ADC3.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_3
Bdma.ADC3.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
ProjectManager.UnderRoot=true
PC12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_MEDIUM
SH.FMC_D7_DA7.ConfNb=1
PC8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_MEDIUM
PE3.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PD11.Signal=GPXTI11
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
SH.FMC_A5.0=FMC_A5,13b-sda1
Dma.SAI1_A.2.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PA11.Signal=GPIO_Output
ADC1.OffsetNumber-16\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.LPTIM345Freq_Value=120000000
ProjectManager.ComputerToolchain=false
PF9.Signal=ADC3_INP2
RCC.LTDCFreq_Value=50390625
PB3\ (JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
ADC3.OffsetSignedSaturation-1\#ChannelRegularConversion=DISABLE
ADC1.EnableRegularConversion=ENABLE
SH.ADCx_INP19.0=ADC1_INP19,IN19-Single-Ended
SPI2.DataSize=SPI_DATASIZE_8BIT
PCC.Seq0.Step1.Vcore=SVOS5\: System-Scale5
PCC.Seq0.Step1.Voltage_Source=Battery
SH.FMC_D12_DA12.ConfNb=1
RCC.HCLK3ClockFreq_Value=240000000
PCC.Seq0=2
PB0.Signal=ADCx_INP9
Dma.SAI1_B.3.FIFOThreshold=DMA_FIFO_THRESHOLD_1QUARTERFULL
PB12.GPIOParameters=GPIO_Speed
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
Dma.SAI1_B.3.SyncEnable=DISABLE
Dma.SPI2_TX.4.MemInc=DMA_MINC_ENABLE
RCC.DIVQ2Freq_Value=172000000
ADC1.RightBitShift=ADC_RIGHTBITSHIFT_1
I2C2.IPParameters=Timing,I2C_Speed_Mode
Dma.SPI2_RX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
RCC.SAI1Freq_Value=49142857.14285714
RCC.CortexFreq_Value=480000000
SH.FMC_A2.ConfNb=1
Mcu.UserName=STM32H743ZITx
PC14-OSC32_IN\ (OSC32_IN).GPIO_PuPd=GPIO_PULLDOWN
RCC.HPRE=RCC_HCLK_DIV2
PCC.Seq0.Step0.User's_Consumption=0 mA
PC10.Signal=SDMMC1_D2
I2C2.Timing=0x00B03FDB
SH.FMC_NBL0.0=FMC_NBL0,Sd2ByteEnable1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_BDMA_Init-BDMA-false-HAL-true,3-MX_DMA_Init-DMA-false-HAL-true,4-SystemClock_Config-RCC-false-HAL-false,5-MX_FMC_Init-FMC-false-HAL-true,6-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,7-MX_FATFS_Init-FATFS-false-HAL-false,8-MX_RNG_Init-RNG-false-HAL-true,9-MX_SPI2_Init-SPI2-false-HAL-true,10-MX_ADC1_Init-ADC1-false-HAL-true,11-MX_ADC3_Init-ADC3-false-HAL-true,12-MX_SAI1_Init-SAI1-false-HAL-true,13-MX_I2C2_Init-I2C2-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
SH.FMC_D6_DA6.0=FMC_D6,sd-16b-d1
SDMMC1.ClockDiv=16
Dma.ADC1.0.FIFOThreshold=DMA_FIFO_THRESHOLD_HALFFULL
Dma.SPI2_RX.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPI2_RX.1.MemBurst=DMA_MBURST_SINGLE
Dma.SAI1_A.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.SPI2_TX.4.Mode=DMA_CIRCULAR
PCC.Seq0.Step1.Duration=0.9 ms
Dma.SAI1_B.3.SyncRequestNumber=1
PB11.Signal=I2C2_SDA
NVIC.DMA1_Stream4_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PE5.GPIOParameters=GPIO_Speed
ProjectManager.StackSize=0x3000
RCC.VCOInput3Freq_Value=781250
Dma.SAI1_B.3.PeriphDataAlignment=DMA_PDATAALIGN_WORD
SH.FMC_A7.0=FMC_A7,13b-sda1
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
FMC.BankMapConfig=FMC_SWAPBMAP_SDRAM_SRAM
RCC.HCLKFreq_Value=240000000
Mcu.IPNb=16
RCC.SPDIFRXFreq_Value=480000000
Dma.SAI1_A.2.RequestNumber=1
PF12.Signal=FMC_A6
Mcu.Pin6=PC14-OSC32_IN (OSC32_IN)
Mcu.Pin7=PF0
Mcu.Pin8=PF1
Mcu.Pin9=PF2
PC9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_MEDIUM
PC2_C.Signal=FMC_SDNE0
SH.FMC_A10.0=FMC_A10,13b-sda1
Mcu.Pin0=PE2
Mcu.Pin1=PE3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE4
Mcu.Pin3=PE5
Mcu.Pin4=PE6
Mcu.Pin5=PC13
ADC3.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_32CYCLES_5
SH.FMC_D8_DA8.0=FMC_D8,sd-16b-d1
PCC.Seq0.Step0.DMIPS=856.00006
FMC.RPDelay1=2
Dma.SPI2_TX.4.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
SH.FMC_D2_DA2.0=FMC_D2,sd-16b-d1
PE13.Signal=FMC_D10_DA10
PE4.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
ADC1.Rank-19\#ChannelRegularConversion=4
File.Version=6
SH.FMC_D5_DA5.ConfNb=1
SH.FMC_D2_DA2.ConfNb=1
PB8.Locked=true
NVIC.SPI2_IRQn=true\:3\:0\:true\:false\:true\:false\:true
PE4.Mode=SAI_A_MasterWithClock
SH.FMC_SDNRAS.0=FMC_SDNRAS,13b-sda1
PE4.Signal=SAI1_FS_A
PE6.GPIOParameters=GPIO_Speed
Dma.RequestsNb=5
Dma.SPI2_TX.4.PeriphBurst=DMA_PBURST_SINGLE
Dma.SAI1_A.2.FIFOThreshold=DMA_FIFO_THRESHOLD_1QUARTERFULL
ProjectManager.ProjectName=cube_for_new_genera_brain4
FATFS._USE_LABEL=1
RCC.APB3Freq_Value=120000000
SH.FMC_D0_DA0.0=FMC_D0,sd-16b-d1
RCC.D1PPRE=RCC_APB3_DIV2
RCC.SDMMC1CLockSelection=RCC_SDMMCCLKSOURCE_PLL2
SH.ADCx_INP15.ConfNb=1
SH.FMC_A9.0=FMC_A9,13b-sda1
Bdma.ADC3.0.SyncRequestNumber=1
SH.FMC_D4_DA4.0=FMC_D4,sd-16b-d1
ADC3.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
PF5.Signal=FMC_A5
PCC.Seq0.Step0.Duration=1 ms
Dma.ADC1.0.MemBurst=DMA_MBURST_SINGLE
Dma.SAI1_B.3.MemDataAlignment=DMA_MDATAALIGN_WORD
PCC.Seq0.Step0.Peripherals=Bridge_AHB3 FMC SDMMC1 Bridge_AHB2 Bridge_APB1 Bridge_APB2 I2C2 RNG SAI1 SPI2 Bridge_AHB4 Bridge_APB4 GPIOA GPIOB GPIOC GPIOD GPIOE GPIOF GPIOG GPIOH SYS
SH.ADCx_INP15.0=ADC1_INP15,IN15-Single-Ended
SPI2.Direction=SPI_DIRECTION_2LINES
PF0.Signal=FMC_A0
SH.FMC_NBL0.ConfNb=1
PCC.Seq0.Step1.Mode=STOP
SAI1.BasicProtocol-SAI_A_MasterWithClock=SAI_I2S_STANDARD
PE3.Mode=SAI_B_SyncSlave
RCC.Tim2OutputFreq_Value=240000000
Dma.SAI1_A.2.MemBurst=DMA_MBURST_SINGLE
RCC.DFSDMACLkFreq_Value=49142857.14285714
Dma.SAI1_A.2.Mode=DMA_CIRCULAR
PCC.Seq0.Step1.CPU_Frequency=0 Hz
SH.FMC_A12.0=FMC_A12,13b-sda1
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ADC3.DiscontinuousConvMode=DISABLE
SH.FMC_A9.ConfNb=1
CORTEX_M7.CPU_ICache=Enabled
PA13\ (JTMS/SWDIO).Mode=Trace_Asynchronous_SW
ProjectManager.NoMain=false
ADC1.SamplingTime-16\#ChannelRegularConversion=ADC_SAMPLETIME_32CYCLES_5
PG1.Signal=FMC_A11
RCC.SAI4BFreq_Value=480000000
SH.FMC_SDCLK.ConfNb=1
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
NVIC.DMA1_Stream1_IRQn=true\:0\:0\:false\:false\:true\:false\:true
VP_RNG_VS_RNG.Mode=RNG_Activate
Dma.SPI2_RX.1.EventEnable=DISABLE
PC14-OSC32_IN\ (OSC32_IN).Locked=true
Dma.SAI1_B.3.FIFOMode=DMA_FIFOMODE_ENABLE
RCC.SPI6Freq_Value=120000000
PC12.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default
PF7.Mode=IN3-Single-Ended
SH.ADCx_INP9.ConfNb=1
Dma.SAI1_A.2.SignalID=NONE
PCC.Seq0.Step0.TaMax=110.11
RCC.SPI45Freq_Value=120000000
Dma.SPI2_TX.4.Instance=DMA1_Stream4
PB3\ (JTDO/TRACESWO).Locked=true
PB3\ (JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
ProjectManager.TargetToolchain=STM32CubeIDE
Dma.SAI1_A.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
FATFS0.BSP.condition=
PCC.Seq0.Step1.User's_Consumption=0 mA
Bdma.ADC3.0.EventEnable=DISABLE
Dma.ADC1.0.Mode=DMA_CIRCULAR
SH.FMC_D1_DA1.ConfNb=1
Dma.ADC1.0.SyncSignalID=NONE
Bdma.RequestsNb=1
ADC3.OversamplingMode=DISABLE
PC11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_MEDIUM
PF2.Signal=FMC_A2
ProjectManager.RegisterCallBack=
PE11.Signal=FMC_D8_DA8
Dma.SPI2_TX.4.FIFOMode=DMA_FIFOMODE_ENABLE
PB12.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
Bdma.ADC3.0.Mode=DMA_CIRCULAR
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,InitProtocol-SAI_A_MasterWithClock,VirtualProtocol-SAI_A_BASIC,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,InitProtocol-SAI_B_SyncSlave,VirtualProtocol-SAI_B_BASIC,AudioMode-SAI_A_MasterWithClock,AudioFrequency-SAI_A_MasterWithClock,BasicDataSize-SAI_A_MasterWithClock,BasicDataSize-SAI_B_SyncSlave,BasicProtocol-SAI_B_SyncSlave,BasicProtocol-SAI_A_MasterWithClock,FIFOThreshold-SAI_B_SyncSlave,FIFOThreshold-SAI_A_MasterWithClock
PCC.Temperature=25
ADC1.NbrOfDiscConversion=4
Dma.SPI2_RX.1.SignalID=NONE
RCC.VCOInput1Freq_Value=5000000
Dma.ADC1.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.ADC1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,FIFOThreshold,MemBurst,PeriphBurst,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
FATFS.USE_DMA_CODE_SD=0
SAI1.BasicDataSize-SAI_A_MasterWithClock=SAI_PROTOCOL_DATASIZE_32BIT
RCC.APB2Freq_Value=120000000
PCC.Seq0.Step0.Frequency=25 MHz
SH.FMC_D13_DA13.ConfNb=1
PC13.GPIOParameters=GPIO_PuPd
PB15.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
ADC1.Channel-16\#ChannelRegularConversion=ADC_CHANNEL_9
PF15.Signal=FMC_A9
PE6.Signal=SAI1_SD_A
PB15.GPIOParameters=GPIO_Speed
Mcu.Name=STM32H743ZITx
ADC3.ConversionDataManagement=ADC_CONVERSIONDATA_DMA_CIRCULAR
Dma.SPI2_RX.1.PeriphInc=DMA_PINC_DISABLE
RCC.PLL3_VCI_Range-AdvancedSettings=RCC_PLL3VCIRANGE_0
PD14.Signal=FMC_D0_DA0
PCC.Seq0.Step0.Memory=SRAM1
PC14-OSC32_IN\ (OSC32_IN).Signal=GPIO_Output
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
Dma.ADC1.0.SyncEnable=DISABLE
PCC.Seq0.Step1.Frequency=0 Hz
Dma.SAI1_A.2.SyncSignalID=NONE
RCC.SAI4AFreq_Value=480000000
ADC1.NbrOfConversionFlag=1
FATFS0.BSP.component=
ADC1.OffsetNumber-18\#ChannelRegularConversion=ADC_OFFSET_NONE
RCC.DIVQ1Freq_Value=480000000
PB8.Signal=GPIO_Output
Dma.SAI1_B.3.Mode=DMA_CIRCULAR
RCC.D3PPRE=RCC_APB4_DIV2
PC9.Signal=SDMMC1_D1
SDMMC1.IPParameters=ClockDiv
RCC.VCOInput2Freq_Value=1000000
Dma.SAI1_B.3.PeriphBurst=DMA_PBURST_SINGLE
RCC.APB1Freq_Value=120000000
SAI1.InitProtocol-SAI_B_SyncSlave=Enable
ADC1.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
ProjectManager.DeviceId=STM32H743ZITx
ProjectManager.LibraryCopy=1
Dma.SAI1_A.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
isbadioc=false
